app/controllers/accounts_controller.rb

  def index
    @accounts = Account.all
---
SELECT "accounts".* FROM "accounts"

  def create
    @account = Account.new(account_params)
    respond_to do |format|
      if @account.save
---
INSERT INTO "accounts" ("number", "balance_cents", "balance_currency", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["number", 123456], ["balance_cents", 1], ["balance_currency", "BRL"], ["created_at", "2022-07-12 23:06:40.905062"], ["updated_at", "2022-07-12 23:06:40.905062"]]

  def update
    respond_to do |format|
      if @account.update(account_params)
---
UPDATE "accounts" SET "balance_cents" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["balance_cents", 1], ["updated_at", "2022-07-12 22:19:29.473332"], ["id", 2]]

    def set_account
      @account = Account.find(params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]