app/controllers/transactions_controller.rb

SELECT "transactions".* FROM "transactions"
---
  def index
    @transactions = Transaction.all

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @account = Account.find params[:account_id]

INSERT INTO "transactions" ("value_cents", "value_currency", "transaction_type", "account_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["value_cents", 1], ["value_currency", "BRL"], ["transaction_type", 0], ["account_id", 1], ["created_at", "2022-07-12 23:51:41.806890"], ["updated_at", "2022-07-12 23:51:41.806890"]]
---
  def create
    @transaction = Transaction.new(transaction_params)
    respond_to do |format|
      if @transaction.save

SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_transaction
      @transaction = Transaction.find(params[:id])